[
  {
    "id": "filppula-klemola-2017",
    "title": "Celtic and Celtic Englishes",
    "authors": "Markku Filppula, Juhani Klemola",
    "journal": "Varieties of English (Volume 5)",
    "conference": "",
    "year": "2017",
    "url": "https://www.degruyter.com/document/doi/10.1515/9783110525045-011/html",
    "hypotheses": "Two-wave Celtic substrate influence hypothesis - early medieval and modern contact periods",
    "notes": "Systematic analysis of progressive aspect and it-cleft constructions as evidence for Celtic substrate influence. Argues for continued contact influences between Celtic and English across historical periods.",
    "strengths": "Comprehensive theoretical framework, systematic feature analysis, historical periodization",
    "weaknesses": "Limited quantitative evidence, relies heavily on typological similarity",
    "citation": "Filppula, M., & Klemola, J. (2017). Celtic and Celtic Englishes. In Varieties of English (Vol. 5). De Gruyter Mouton.",
    "_isExample": false
  },
  {
    "id": "hickey-2020",
    "title": "English and Celtic: contact-induced change in history",
    "authors": "Raymond Hickey",
    "journal": "Linguistics Vanguard",
    "conference": "",
    "year": "2020",
    "url": "https://www.degruyter.com/document/doi/10.1515/lingvan-2019-0037/html",
    "hypotheses": "Systematic contact-induced change through specific sociolinguistic mechanisms",
    "notes": "Overview of English-Celtic contact research with taxonomic classification of contact scenarios and linguistic effects. Emphasizes geographical and temporal dimensions of contact.",
    "strengths": "Comprehensive methodological framework, systematic classification of contact types, cross-linguistic perspective",
    "weaknesses": "Primarily review/synthesis rather than new empirical data",
    "citation": "Hickey, R. (2020). English and Celtic: contact-induced change in history. Linguistics Vanguard, 6(s2).",
    "_isExample": false
  },
  {
    "id": "lutz-2009",
    "title": "Celtic influence on Old English and West Germanic",
    "authors": "Angelika Lutz",
    "journal": "English Language & Linguistics",
    "conference": "",
    "year": "2009",
    "url": "https://www.cambridge.org/core/journals/english-language-and-linguistics/article/celtic-influence-on-old-english-and-west-germanic/15B3198DAAE8C1989D0EE44B83B70B7C",
    "hypotheses": "Extensive and sustained Celtic-Germanic contact with specific sociolinguistic transmission mechanisms",
    "notes": "Critical analysis demonstrating that Celtic-Anglo-Saxon contact was more extensive than traditionally assumed. Establishes sociolinguistic mechanisms for substrate influence through bilingual communities and language shift scenarios.",
    "strengths": "Rigorous historical analysis, detailed sociolinguistic reconstruction, extensive documentation",
    "weaknesses": "Limited corpus-based quantitative analysis",
    "citation": "Lutz, A. (2009). Celtic influence on Old English and West Germanic. English Language & Linguistics, 13(2), 227-249.",
    "_isExample": false
  },
  {
    "id": "bradley-2011",
    "title": "To be, or not two be's? Celtic substrate influence on the Old English copula",
    "authors": "Luke Bradley",
    "journal": "Queen Mary's OPAL",
    "conference": "",
    "year": "2011",
    "url": "https://www.qmul.ac.uk/sllf/media/sllf-new/department-of-linguistics/documents/28)-QMOPAL-Bradley-long.pdf",
    "hypotheses": "Celtic substrate influence correlates with demographic intensity of Celtic populations in different OE dialect areas",
    "notes": "Corpus analysis of Old English copula usage patterns across dialects. Demonstrates correlation between Celtic population density and substrate effects in North, West, and Midlands regions.",
    "strengths": "Quantitative corpus analysis, systematic dialectal comparison, demographic correlation",
    "weaknesses": "Limited to single grammatical feature, undergraduate thesis level analysis",
    "citation": "Bradley, L. (2011). To be, or not two be's? Celtic substrate influence on the Old English copula. Queen Mary's OPAL, 28.",
    "_isExample": false
  },
  {
    "id": "niehues-2006",
    "title": "The Influences of the Celtic Languages on Present-Day English",
    "authors": "Jan Niehues",
    "journal": "Magistrareit, Philipps-Universit채t Marburg",
    "conference": "",
    "year": "2006",
    "url": "https://archiv.ub.uni-marburg.de/ed/2007/0001/pdf/niehuMA.pdf",
    "hypotheses": "Chronological stratification hypothesis - substrate features entered English during distinct historical periods",
    "notes": "Comprehensive analysis of temporal dimensions in Celtic substrate influence. Argues for stratified process rather than single contact event, with different features entering at different historical periods.",
    "strengths": "Systematic chronological analysis, comprehensive feature coverage, methodological innovation",
    "weaknesses": "Master's thesis level, limited peer review, some speculative elements",
    "citation": "Niehues, J. (2006). The Influences of the Celtic Languages on Present-Day English. Magisterarbeit, Philipps-Universit채t Marburg.",
    "_isExample": false
  },
  {
    "id": "lim-2017",
    "title": "Celtic Influences on the English Progressive Form",
    "authors": "John Lim",
    "journal": "Academia.edu",
    "conference": "",
    "year": "2017",
    "url": "https://www.academia.edu/34916640/Celtic_Influences_on_the_English_Progressive_Form",
    "hypotheses": "Celtic substrate origin for English progressive aspect development",
    "notes": "Detailed analysis of parallels between Celtic and English progressive constructions. Systematic comparison of native development, Latin, French, and Celtic hypotheses for progressive aspect origin.",
    "strengths": "Systematic hypothesis comparison, detailed linguistic analysis, clear methodology",
    "weaknesses": "Not peer-reviewed publication, limited historical documentation",
    "citation": "Lim, J. (2017). Celtic Influences on the English Progressive Form. Academia.edu.",
    "_isExample": false
  },
  {
    "id": "warner-1993",
    "title": "English Auxiliaries: Structure and History",
    "authors": "Anthony R. Warner",
    "journal": "Cambridge University Press",
    "conference": "",
    "year": "1993",
    "url": "https://www.cambridge.org/core/books/english-auxiliaries/737ED87417051D24BAF69CA979806EAB",
    "hypotheses": "English auxiliary development follows non-Germanic patterns consistent with Celtic systems",
    "notes": "Foundational analysis of English auxiliary system development within comparative Germanic framework. Demonstrates that English auxiliary patterns are unprecedented in Germanic but consistent with Celtic grammatical systems.",
    "strengths": "Authoritative scholarship, comprehensive historical analysis, comparative Germanic perspective",
    "weaknesses": "Published before recent advances in Celtic hypothesis research",
    "citation": "Warner, A. R. (1993). English Auxiliaries: Structure and History. Cambridge University Press.",
    "_isExample": false
  },
  {
    "id": "culicover-2008",
    "title": "The Rise and Fall of Constructions and the History of English Do-Support",
    "authors": "Peter W. Culicover",
    "journal": "Journal of Germanic Linguistics",
    "conference": "",
    "year": "2008",
    "url": "https://www.asc.ohio-state.edu/culicover.1/Publications/do.pdf",
    "hypotheses": "Do-support as unique English characteristic requiring special explanation",
    "notes": "Analysis of do-support as uniquely English phenomenon. Questions why do-support developed in English but not other Germanic languages, suggesting special historical circumstances.",
    "strengths": "Rigorous formal analysis, cross-Germanic comparison, construction grammar approach",
    "weaknesses": "Doesn't explicitly consider Celtic substrate explanation",
    "citation": "Culicover, P. W. (2008). The Rise and Fall of Constructions and the History of English Do-Support. Journal of Germanic Linguistics, 20(1), 1-52.",
    "_isExample": false
  },
  {
    "id": "jager-2007",
    "title": "Grammaticalization paths of periphrastic 'do'-constructions",
    "authors": "Andreas J채ger",
    "journal": "Studies van de BKL",
    "conference": "",
    "year": "2007",
    "url": "https://sites.uclouvain.be/bkl-cbl/wp-content/uploads/2014/08/jag2007.pdf",
    "hypotheses": "English do-support follows Celtic-type grammaticalization pathways",
    "notes": "Cross-linguistic analysis of 200 languages showing do-periphrasis patterns. Demonstrates that English-type do-support exhibits specific properties aligning with Celtic rather than Germanic patterns.",
    "strengths": "Large cross-linguistic sample, systematic typological analysis, grammaticalization focus",
    "weaknesses": "Limited historical depth for English-specific analysis",
    "citation": "J채ger, A. (2007). Grammaticalization paths of periphrastic 'do'-constructions. Studies van de BKL, 2007, 353-380.",
    "_isExample": false
  },
  {
    "id": "borsley-2009",
    "title": "Celtic influence in English? Yes and No",
    "authors": "Robert D. Borsley, Maggie Tallerman, David Willis",
    "journal": "English Language & Linguistics",
    "conference": "",
    "year": "2009",
    "url": "https://www.researchgate.net/publication/231812865_Celtic_influence_in_English_Yes_and_No",
    "hypotheses": "Celtic substrate influence on English response particle systems",
    "notes": "Analysis of English Yes/No response patterns showing divergence from Germanic systems. Demonstrates that English response patterns mirror Celtic systems and represent Late Middle English innovation.",
    "strengths": "Systematic comparison with Germanic languages, historical corpus analysis, clear Celtic parallels",
    "weaknesses": "Limited to single grammatical feature",
    "citation": "Borsley, R. D., Tallerman, M., & Willis, D. (2009). Celtic influence in English? Yes and No. English Language & Linguistics, 13(2), 251-270.",
    "_isExample": false
  },
  {
    "id": "hickey-2000",
    "title": "Early contact and parallels between English and Celtic",
    "authors": "Raymond Hickey",
    "journal": "Sounds and Systems",
    "conference": "",
    "year": "2000",
    "url": "https://www.academia.edu/11177571/Early_contact_and_parallels_between_English_and_Celtic1",
    "hypotheses": "Integrated methodological approach combining multiple lines of evidence for substrate influence",
    "notes": "Establishes critical methodological foundations for Celtic substrate research. Argues for integrated approaches combining historical sociolinguistics, comparative-historical linguistics, and corpus-based analysis.",
    "strengths": "Methodological innovation, systematic framework development, rigorous standards for evidence",
    "weaknesses": "Primarily methodological rather than empirical contribution",
    "citation": "Hickey, R. (2000). Early contact and parallels between English and Celtic. In Sounds and Systems (pp. 1-32).",
    "_isExample": false
  },
  {
    "id": "roberge-hickey-2020",
    "title": "Contact and the History of Germanic Languages",
    "authors": "Paul Roberge, Raymond Hickey",
    "journal": "Wiley",
    "conference": "",
    "year": "2020",
    "url": "https://www.researchgate.net/publication/344567755_Contact_and_the_History_of_Germanic_Languages",
    "hypotheses": "Celtic substrate effects as part of broader contact-induced change patterns in Germanic",
    "notes": "Comparative analysis of contact-induced change across Germanic languages. Demonstrates that Celtic substrate effects in English are part of broader patterns operating according to predictable sociolinguistic principles.",
    "strengths": "Comprehensive Germanic perspective, systematic contact linguistics framework, theoretical integration",
    "weaknesses": "Broad scope limits detailed English-specific analysis",
    "citation": "Roberge, P., & Hickey, R. (2020). Contact and the History of Germanic Languages. Wiley.",
    "_isExample": false
  },
  {
    "id": "owen-2018",
    "title": "An Evaluation of the Celtic Hypothesis for Brythonic Celtic influence on Early English",
    "authors": "Judith Margaret Owen",
    "journal": "Master of Philosophy thesis, Australian National University",
    "conference": "",
    "year": "2018",
    "url": "https://openresearch-repository.anu.edu.au/bitstreams/b4fe9f20-2601-41c5-9652-6ee5b8d64d54/download",
    "hypotheses": "Systematic evaluation of Celtic substrate claims using corpus-based quantitative methods",
    "notes": "Comprehensive evaluation employing systematic corpus analysis to test substrate claims. Emphasizes quantitative analysis and statistical validation, moving beyond impressionistic observations.",
    "strengths": "Rigorous quantitative methodology, systematic evaluation framework, comprehensive coverage",
    "weaknesses": "Master's thesis level, conclusions somewhat skeptical of substrate claims",
    "citation": "Owen, J. M. (2018). An Evaluation of the Celtic Hypothesis for Brythonic Celtic influence on Early English. Master of Philosophy thesis, Australian National University.",
    "_isExample": false
  },
  {
    "id": "rivas-2017",
    "title": "The Celtic Hypothesis - Do we actually speak British?",
    "authors": "Montse Rivas",
    "journal": "UNED",
    "conference": "",
    "year": "2017",
    "url": "https://www.academia.edu/34535711/The_Celtic_Hypothesis_Do_we_actually_speak_British",
    "hypotheses": "Digital humanities approaches to revealing substrate influence patterns",
    "notes": "Corpus-based evidence using digital humanities approaches to reveal previously hidden patterns of substrate influence through large-scale textual analysis.",
    "strengths": "Digital humanities methodology, large-scale analysis, systematic approach",
    "weaknesses": "Not peer-reviewed publication, limited theoretical framework",
    "citation": "Rivas, M. (2017). The Celtic Hypothesis - Do we actually speak British? UNED.",
    "_isExample": false
  },
  {
    "id": "mcwhorter-2009",
    "title": "What else happened to English? A brief for the Celtic hypothesis",
    "authors": "John H. McWhorter",
    "journal": "English Language & Linguistics",
    "conference": "",
    "year": "2009",
    "url": "https://www.cambridge.org/core/journals/english-language-and-linguistics/article/what-else-happened-to-english-a-brief-for-the-celtic-hypothesis/7E774117C3B14855E00C75C0726DD095",
    "hypotheses": "English exhibits complexity reduction patterns characteristic of contact-induced change",
    "notes": "Influential argumentation for Celtic hypothesis based on complexity reduction patterns. Argues that English exhibits contact-induced changes rather than internal Germanic development patterns.",
    "strengths": "Clear theoretical framework, systematic argumentation, influential in field development",
    "weaknesses": "Some controversial claims, relies on typological arguments",
    "citation": "McWhorter, J. H. (2009). What else happened to English? A brief for the Celtic hypothesis. English Language & Linguistics, 13(2), 163-183.",
    "_isExample": false
  },
  {
    "id": "kuteva-2019",
    "title": "World lexicon of grammaticalization (2nd edition)",
    "authors": "Tania Kuteva, Bernd Heine, Bo Hong, Haiping Long, Heiko Narrog, Seongha Rhee",
    "journal": "Cambridge University Press",
    "conference": "",
    "year": "2019",
    "url": "https://www.cambridge.org/core/books/world-lexicon-of-grammaticalization/8B7B7A6E8F7D3C5A9A5B2C4E8F9E1A2B",
    "hypotheses": "Cross-linguistic databases enabling systematic comparison of grammaticalization pathways",
    "notes": "Comprehensive database of grammaticalization pathways across 1,009 languages. Enables systematic comparison revealing that English patterns often align more closely with Celtic than Germanic systems.",
    "strengths": "Massive cross-linguistic database, rigorous methodology, computational resources",
    "weaknesses": "General resource rather than English-Celtic specific analysis",
    "citation": "Kuteva, T., Heine, B., Hong, B., Long, H., Narrog, H., & Rhee, S. (2019). World lexicon of grammaticalization (2nd edition). Cambridge University Press.",
    "_isExample": false
  },
  {
    "id": "wischer-2008",
    "title": "Grammaticalization of periphrastic constructions",
    "authors": "Ilse Wischer",
    "journal": "Studies on Grammaticalization",
    "conference": "",
    "year": "2008",
    "url": "https://www.degruyterbrill.com/document/doi/10.1515/9783110211764.4.241/html",
    "hypotheses": "Contact-induced grammaticalization requires usage-based and construction grammar approaches",
    "notes": "Theoretical analysis establishing frameworks for analyzing contact-induced grammaticalization. Moves beyond traditional historical-comparative methods to incorporate usage-based and construction grammar approaches.",
    "strengths": "Theoretical innovation, methodological advancement, construction grammar integration",
    "weaknesses": "Primarily theoretical rather than empirical",
    "citation": "Wischer, I. (2008). Grammaticalization of periphrastic constructions. In Studies on Grammaticalization (pp. 241-252). De Gruyter.",
    "_isExample": false
  },
  {
    "id": "klemola-filppula-2016",
    "title": "Contact-related processes of change in the early history of English",
    "authors": "Juhani Klemola, Markku Filppula",
    "journal": "The Cambridge Handbook of English Historical Linguistics",
    "conference": "",
    "year": "2016",
    "url": "https://www.cambridge.org/core/books/cambridge-handbook-of-english-historical-linguistics/contactrelated-processes-of-change-in-the-early-history-of-english/2EAD377B9F30C31009DAC497AEAB3087",
    "hypotheses": "Systematic contact-related change processes in early English development",
    "notes": "Comprehensive analysis of contact-related processes in early English history within authoritative handbook context. Provides systematic framework for understanding Celtic substrate influence.",
    "strengths": "Authoritative handbook chapter, comprehensive coverage, systematic framework",
    "weaknesses": "Handbook format limits detailed analysis depth",
    "citation": "Klemola, J., & Filppula, M. (2016). Contact-related processes of change in the early history of English. In The Cambridge Handbook of English Historical Linguistics (pp. 361-377). Cambridge University Press.",
    "_isExample": false
  },
  {
    "id": "hewitt-2019",
    "title": "The Question of a Hamito-Semitic Substratum in Insular Celtic and Celtic from the West",
    "authors": "Steve Hewitt",
    "journal": "Academia.edu",
    "conference": "",
    "year": "2019",
    "url": "https://www.academia.edu/40827562/The_Question_of_a_Hamito_Semitic_Substratum_in_Insular_Celtic_and_Celtic_from_the_West",
    "hypotheses": "Multiple substrate layers in Celtic languages affecting subsequent English contact",
    "notes": "Analysis of pre-Celtic substrates in Insular Celtic languages, relevant to understanding the substrate linguistic environment during Celtic-English contact periods.",
    "strengths": "Novel theoretical perspective, deep historical analysis, substrate layering approach",
    "weaknesses": "Not peer-reviewed, highly speculative, indirect relevance to English",
    "citation": "Hewitt, S. (2019). The Question of a Hamito-Semitic Substratum in Insular Celtic and Celtic from the West. Academia.edu.",
    "_isExample": false
  },
  {
    "id": "hickey-2022",
    "title": "Language change in early Britain: the convergence account",
    "authors": "Raymond Hickey",
    "journal": "Sounds and Systems",
    "conference": "",
    "year": "2022",
    "url": "https://www.academia.edu/92101400/Language_change_in_early_Britain_the_convergence_account",
    "hypotheses": "Convergence model for understanding Celtic-English contact outcomes",
    "notes": "Recent theoretical development proposing convergence model for understanding language change in early Britain. Focuses on Northern Subject Rule and other contact phenomena.",
    "strengths": "Recent theoretical innovation, systematic convergence model, empirical grounding",
    "weaknesses": "Limited scope to specific features, relatively new theoretical framework",
    "citation": "Hickey, R. (2022). Language change in early Britain: the convergence account. In Sounds and Systems (pp. 185-197).",
    "_isExample": false
  }
]